mistyrain83/cc3200app/user/wifiapp/main.c
       // Blink LED 3 times to Indicate AP Mode
       for(cCount = 0;cCount<3;cCount++)
       {
           //Turn RED LED On
           GPIO_IF_LedOn(MCU_RED_LED_GPIO);
           osi_Sleep(400);
           
           //Turn RED LED Off
           GPIO_IF_LedOff(MCU_RED_LED_GPIO);
           osi_Sleep(400);
       }

       char ssid[32];
	   unsigned short len = 32;
	   unsigned short config_opt = WLAN_AP_OPT_SSID;
	   sl_WlanGet(SL_WLAN_CFG_AP_ID, &config_opt , &len, (unsigned char* )ssid);
	   UART_PRINT("\n\r Connect to : \'%s\'\n\r\n\r", ssid);
    }
    else
    {
        //Stop Internal HTTP Server
        lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

        //Start Internal HTTP Server
        lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

    	//waiting for the device to Auto Connect
        while(uiConnectTimeoutCnt<AUTO_CONNECTION_TIMEOUT_COUNT &&
            ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))) 
        {
            //Turn RED LED On
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            osi_Sleep(50);
            
            //Turn RED LED Off
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
            osi_Sleep(50);
            
            uiConnectTimeoutCnt++;
        }
        //Couldn't connect Using Auto Profile
        if(uiConnectTimeoutCnt == AUTO_CONNECTION_TIMEOUT_COUNT)
        {
            //Blink Red LED to Indicate Connection Error
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            
            CLR_STATUS_BIT_ALL(g_ulStatus);

            //Connect Using Smart Config
            lRetVal = SmartConfigConnect();
            ASSERT_ON_ERROR(lRetVal);

            //Waiting for the device to Auto Connect
            while((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))
            {
                MAP_UtilsDelay(500);              
            }
    }
    //Turn RED LED Off
    GPIO_IF_LedOff(MCU_RED_LED_GPIO);

    //g_iInternetAccess = ConnectionTest();

    }
    return SUCCESS;
}


//****************************************************************************
//
//!    \brief Read Force AP GPIO and Configure Mode - 1(Access Point Mode)
//!                                                  - 0 (Station Mode)
//!
//! \return                        None
//
//****************************************************************************
static void ReadDeviceConfiguration()
{
    unsigned int uiGPIOPort;
    unsigned char pucGPIOPin;
    unsigned char ucPinValue;
        
    // Read GPIO
    GPIO_IF_GetPortNPin(SH_GPIO_3, &uiGPIOPort, &pucGPIOPin);
    ucPinValue = GPIO_IF_Get(SH_GPIO_3, uiGPIOPort, pucGPIOPin);
        
    // If Button be pressed, Mode is AP
    if(ucPinValue == 0)
    {
        //AP Mode
        g_uiDeviceModeConfig = ROLE_AP;
    }
    else
    {
        //STA Mode
        g_uiDeviceModeConfig = ROLE_STA;
    }

}

//****************************************************************************
//
//!    \brief OOB Application Main Task - Initializes SimpleLink Driver and
//!                                              Handles HTTP Requests
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void OOBTask(void *pvParameters)
{
	int i;
    long   lRetVal = -1;
	SlSockAddrIn_t  sAddr;
	int             iAddrSize;
    int             iSockID;
    int             iStatus;
	unsigned short usLoopNum;
	long            lNonBlocking = 1;
	int             iCounter;

    //Read Device Mode Configuration
    ReadDeviceConfiguration();

    //Connect to Network
    lRetVal = ConnectToNetwork();
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }

	// filling the buffer
    for (iCounter=0 ; iCounter<BUF_SIZE ; iCounter++)
    {
        g_cBsdBuf[iCounter] = (char)(iCounter);
    }

	lRetVal = BsdTcpServer(&iSockID, TCP_LISTEN_PORT);
    if(lRetVal < 0)
    {
        UART_PRINT("TCP Server create failed\n\r");
        LOOP_FOREVER();
    }
	//UART_PRINT("before accept\n\r");
    //g_iTcpSocketID = SL_EAGAIN;

	
    // waiting for an incoming TCP connection
    while( 1 )
    {
		// GREEN LED ON Indicate NO Communication with Client
		if(GPIO_IF_LedStatus(MCU_GREEN_LED_GPIO) == 1)
		{
			GPIO_IF_LedOn(MCU_GREEN_LED_GPIO);
		}
		
        // accepts a connection form a TCP client, if there is any
        // otherwise returns SL_EAGAIN
        g_iTcpSocketID = sl_Accept(iSockID, ( struct SlSockAddr_t *)&sAddr, 
                                (SlSocklen_t*)&iAddrSize);
        if( g_iTcpSocketID == SL_EAGAIN )
        {
           MAP_UtilsDelay(10000);
        }
        else if( g_iTcpSocketID < 0 )
        {
            // error
            UART_PRINT("[WARN] Accept Error!\n");
            sl_Close(g_iTcpSocketID);
            sl_Close(iSockID);
			//break;
        }
		else
		{
			// setting socket option to make the socket as non blocking
			iStatus = sl_SetSockOpt(g_iTcpSocketID, SL_SOL_SOCKET, SL_SO_NONBLOCKING, 
									&lNonBlocking, sizeof(lNonBlocking));
			if( iStatus < 0 )
			{
				UART_PRINT("[WARN] SetSockOpt Error!\n");
				sl_Close(g_iTcpSocketID);
			}
		}

		

		while(1)
		{
			// GREEN LED OFF Indicate YES Communication with Client
			if(GPIO_IF_LedStatus(MCU_GREEN_LED_GPIO) == 0)
			{
				GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);
			}
			
			iStatus = sl_Recv(g_iTcpSocketID, g_ucBsdRecvBuf, BUF_RECV_SIZE, 0);
	        if( iStatus == 0 )
	        {
	          // error
	          UART_PRINT("[WARN] Client Closed!\n");
	          sl_Close(g_iTcpSocketID);
	          //sl_Close(iSockID);
			  //g_iTcpSocketID = SL_SOC_ERROR;  // re-connect
			  break;
	        }

			for(i = 0; i < iStatus; i++)
			{
				UART_PRINT("0x%x\n\r", g_ucBsdRecvBuf[i]);
			}
			

			// parse receive buf
			if(iStatus > 0)
			{
				parseDOCmd(g_ucBsdRecvBuf, iStatus);
			}

			// send buf
			if(g_iSendLoopNum >= MSG_SEND_LOOP_NUM)
			{
				g_iSendLoopNum = 0;
				
				g_cBsdBuf[0] = MSG_TYPE_SEND;
				g_cBsdBuf[1] = MSG_VER_CONTROL4;
				g_cBsdBuf[2] = CMD_TYPE_DO;
				g_cBsdBuf[3] = DO_CHN_NUM;
				g_cBsdBuf[4] = GPIO_IF_DOStatus(MCU_DO1_IND);
				g_cBsdBuf[5] = GPIO_IF_DOStatus(MCU_DO2_IND);
				g_cBsdBuf[6] = GPIO_IF_DOStatus(MCU_DO3_IND);
				g_cBsdBuf[7] = GPIO_IF_DOStatus(MCU_DO4_IND);
				//g_cBsdBuf[8] = 0x00;
				//sTestBufLen = 6;
		        // sending packet
		        iStatus = sl_Send(g_iTcpSocketID, g_cBsdBuf, 8, 0 );
		        if( iStatus <= 0 )
		        {
					UART_PRINT("[WARN] Send ERROR!\n");
		          sl_Close(g_iTcpSocketID);
		            // error
		          
